<?php

 # Массив прыгает от элемента к элементу на задданное кол-во цифр узла, сколько прыжков сделать массив до выхода из массива


    $arr [] = '4';
    $arr [] = '12';
    $arr [] = '72';
    $arr [] = '11';
    $arr [] = '3';
    $arr [] = '712';
    $arr [] = '5';
    $arr [] = '2';
    $arr [] = '2';
    $arr [] = '1111';

    $i = 0;
    $a = $arr[$i];

    for($j = 0 ; $j <=count($arr); $j++){

        if($a){
            echo 'jump = ' . $a . '<br>';

            $i = $a+$i;
            $f++;
        }

        $a = $arr[$i];
    }

    echo 'количество прыжков - '  . $f;